{
  "course_title": "Mastering Dog Dollars: Pro Dog Walking Business Management",
  "description": "Transform your dog walking business with this comprehensive course on utilizing Dog Dollars, covering bookings, scheduling, client management, and more.",
  "modules": [
    {
      "title": "Introduction to Dog Dollars",
      "lessons": [
        {
          "title": "Overview of Dog Dollars",
          "description": "Introduction to the Dog Dollars platform and its features for managing dog walking businesses."
        },
        {
          "title": "Setting Up Your Account",
          "description": "Step-by-step guide on signing up and setting up your Dog Dollars account for the first time."
        }
      ]
    },
    {
      "title": "Scheduling and Bookings",
      "lessons": [
        {
          "title": "Smart Scheduling",
          "description": "How to use schedule blocks, recurring bookings, and the drag-and-drop calendar for efficient management."
        },
        {
          "title": "Managing Bookings",
          "description": "Handling bookings, including creating, editing, and canceling them within the Dog Dollars platform."
        }
      ]
    },
    {
      "title": "Client Management",
      "lessons": [
        {
          "title": "Client Profiles",
          "description": "Creating and managing client profiles, including their pets, preferences, and booking history."
        },
        {
          "title": "Visit Report Cards",
          "description": "How to send professional report cards with photos, potty reports, and notes after every walk."
        }
      ]
    },
    {
      "title": "Payments and Invoicing",
      "lessons": [
        {
          "title": "Invoicing and Payments",
          "description": "Understanding how to generate invoices automatically and accept online payments through Dog Dollars."
        },
        {
          "title": "GPS Tracking and Photo Updates",
          "description": "Using optional GPS tracking and photo updates to enhance the client experience."
        }
      ]
    },
    {
      "title": "Business Analytics and Growth",
      "lessons": [
        {
          "title": "Business Insights",
          "description": "How to use Dog Dollars' analytics to track revenue, walker performance, and client retention."
        },
        {
          "title": "Scaling Your Business",
          "description": "Strategies for growing your dog walking business using Dog Dollars' features and insights."
        }
      ]
    },
    {
      "title": "Pricing and Plans",
      "lessons": [
        {
          "title": "Understanding Pricing Plans",
          "description": "Overview of Dog Dollars' pricing plans, including Starter, Pro, and Growth, and how to choose the right plan for your business."
        },
        {
          "title": "Customizing Your Plan",
          "description": "How to customize your Dog Dollars plan as your business grows, including adding staff seats and upgrading features."
        }
      ]
    }
  ]
}