{
  "course_title": "Mastering Dog Walking Business with Dog Dollars",
  "description": "Learn how to efficiently manage and grow your dog walking business using the Dog Dollars platform, covering bookings, schedules, client management, payments, and more.",
  "modules": [
    {
      "title": "Introduction to Dog Walking Business Management",
      "lessons": [
        {
          "title": "Getting Started with Dog Dollars",
          "description": "Overview of the Dog Dollars platform, its features, and how to sign up for a free trial."
        },
        {
          "title": "Setting Up Your Business Profile",
          "description": "How to create and customize your business profile, including adding staff seats, clients, and pets."
        }
      ]
    },
    {
      "title": "Scheduling and Client Management",
      "lessons": [
        {
          "title": "Smart Scheduling with Dog Dollars",
          "description": "Using schedule blocks, recurring bookings, and the drag-and-drop calendar to manage your bookings efficiently."
        },
        {
          "title": "Managing Client Information and Preferences",
          "description": "How to keep track of client details, including their pets, preferences, and booking history."
        }
      ]
    },
    {
      "title": "Payments, Invoicing, and Reporting",
      "lessons": [
        {
          "title": "Invoicing and Online Payments",
          "description": "How to generate invoices automatically and receive online payments through Dog Dollars."
        },
        {
          "title": "Creating and Sending Report Cards",
          "description": "Using Dog Dollars to send beautiful report cards with photos, potty reports, and notes after every walk."
        }
      ]
    },
    {
      "title": "Advanced Features and Analytics",
      "lessons": [
        {
          "title": "GPS Tracking and Photo Updates",
          "description": "How to use GPS tracking to show clients where their pets went on their adventure and sharing photos during walks."
        },
        {
          "title": "Business Analytics and Performance Tracking",
          "description": "Using Dog Dollars analytics to track revenue, walker performance, and client retention."
        }
      ]
    },
    {
      "title": "Growing Your Business with Dog Dollars",
      "lessons": [
        {
          "title": "Marketing Strategies for Dog Walking Businesses",
          "description": "Tips and strategies for marketing your dog walking business and attracting new clients."
        },
        {
          "title": "Scaling Your Business with Dog Dollars",
          "description": "How to use Dog Dollars to manage growth, including adding staff seats, custom domains, and advanced analytics."
        }
      ]
    }
  ]
}